> We are seeing perhaps a related symptom of the change in 5.73.0, present in all versions including 5.77.0, where a SG rule is to be created:
> 
> ```
>   # module.eks.aws_security_group_rule.node["workers_ingress_self"] will be created
>   + resource "aws_security_group_rule" "node" {
>       + description              = "Allow node to communicate with each other."
>       + from_port                = 0
>       + id                       = (known after apply)
>       + prefix_list_ids          = []
>       + protocol                 = "-1"
>       + security_group_id        = "sg-0182135552bf63ca9"
>       + security_group_rule_id   = (known after apply)
>       + self                     = false
>       + source_security_group_id = (known after apply)
>       + to_port                  = 65535
>       + type                     = "ingress"
>     }
> ```
> 
> But creation times out (5m) waiting for the rule to exist, although it is created in AWS
> 
> ```
> module.eks.aws_security_group_rule.node["workers_ingress_self"]: Creating...
> module.eks.aws_security_group_rule.node["workers_ingress_self"]: Still creating... [5m0s elapsed]
> Error: waiting for Security Group (sg-0182135552bf63ca9) Rule (sgrule-156820952) create: couldn't find resource
> ```
> 
> Does not happen in 5.72.1

I encountered the same issue in version 5.77.0 and confirmed that the AWS provider version 5.72.1 resolved the problem.